
## Plan Result (prod)

[CI link](https://github.com/goda6565/portfolio/actions/runs/15206645502)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.cloud_dns.google_dns_managed_zone.example-zone
* Replace
  * module.cloudrun_domain_map.google_cloud_run_domain_mapping.default


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloud_dns.google_dns_managed_zone.example-zone will be created
  + resource "google_dns_managed_zone" "example-zone" {
      + creation_time    = (known after apply)
      + description      = "Managed by Terraform"
      + dns_name         = "goodyfolio.com."
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "goodyfolio-com-zone"
      + name_servers     = (known after apply)
      + project          = "portfolio-460206"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "public"

      + cloud_logging_config {
          + enable_logging = true
        }

      + dnssec_config {
          + kind          = "dns#managedZoneDnsSecConfig"
          + non_existence = (known after apply)
          + state         = "on"

          + default_key_specs (known after apply)
        }
    }

  # module.cloudrun_domain_map.google_cloud_run_domain_mapping.default is tainted, so must be replaced
-/+ resource "google_cloud_run_domain_mapping" "default" {
      ~ id       = "locations/asia-northeast1/namespaces/portfolio-460206/domainmappings/goodyfolio.com" -> (known after apply)
        name     = "goodyfolio.com"
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = "com.google.net.rpc3.RpcException: Caller is not authorized to administer the domain goodyfolio.com. If you own goodyfolio.com, you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com')."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Certificate will not be provisioned unless the domain is made routable."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = "com.google.net.rpc3.RpcException: Caller is not authorized to administer the domain goodyfolio.com. If you own goodyfolio.com, you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com')."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "DomainRoutable"
                    },
                ]
              - observed_generation = 1
              - resource_records    = []
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations           = {} -> null
          ~ effective_annotations = {
              - "run.googleapis.com/operation-id"  = "4f7dba52-6348-4eb4-b672-75a47caa2adb"
              - "serving.knative.dev/creator"      = "terraform-executor@portfolio-460206.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "terraform-executor@portfolio-460206.iam.gserviceaccount.com"
            } -> (known after apply)
          ~ effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1" -> null
                # (1 unchanged element hidden)
            }
          ~ generation            = 1 -> 0
          - labels                = {} -> null
          ~ resource_version      = "AAY1ybDQ5io" -> (known after apply)
          ~ self_link             = "/apis/domains.cloudrun.com/v1/namespaces/186242794041/domainmappings/goodyfolio.com" -> (known after apply)
          ~ uid                   = "63ff9c71-d930-4c05-a3e0-a2a2565c35a6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
          - force_override   = false -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




## :warning: Errors

* add a label prod/destroy: POST https://api.github.com/repos/goda6565/portfolio/issues/36/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":36,"Program":"tfcmt","SHA1":"c45c5c2e75260b6f44f05c7b829753eebcecbacb","Target":"prod","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->